{"pageProps":{"proj_id":"animator","project":{"img":[835,496,"/icons/animator.png"],"title":"Animator","body":["A simple collaborative animation program for animating over audio"],"technologies":["firebase","solid","windi","vite","typescript"],"github":{"repo":"pfgithub/threadclient","branch":"main","file":"packages/animator-ui-web/README.md"},"site":{"kind":"demo","url":"https://animator.pfg.pw/"}},"project_readme":{"text":"<html><head></head><body><h1>\n<a id=\"user-content-animator\" class=\"anchor\" href=\"https://github.com/pfgithub/threadclient/blob/main/#animator\" aria-hidden=\"true\" target=\"_blank\" rel=\"noopener\"><span aria-hidden=\"true\" class=\"octicon octicon-link\"></span></a>Animator</h1>\n<p>Animator was a short (1 week) project to create a simple animation program I could use to make a video.</p>\n<p>Animator is collaborative, so it suppors multiple people editing the same animation at once</p>\n<p>A demo is available online at <a href=\"https://animator.pfg.pw/\" target=\"_blank\" rel=\"noopener\">https://animator.pfg.pw/</a></p>\n<p>Animator was created using</p>\n<ul>\n<li>Firebase Realtime Database configured with strict security rules</li>\n<li>Firebase Storage</li>\n<li>Firebase Authentication</li>\n<li>Solid JS, a javascript framework similar to React</li>\n<li>Windi CSS, a utility-first CSS library similar to Tailwind</li>\n<li>Vite, a fast javascript website bundler</li>\n<li>Typescript</li>\n</ul>\n<p>While I have finished developing this project, it is not yet complete. Many workarounds were needed while creating\nthe video.</p>\n<ul>\n<li>Switching between tools (pen/eraser) requires editing code and using hot reload to get the changes without\nreloading the page</li>\n<li>The canvas cannot be zoomed or rotated</li>\n<li>Onion skinning only shows one frame behind and one frame ahead</li>\n<li>Frames cannot be copy/pasted</li>\n<li>Complicated frames take a long time to render</li>\n<li>Playback does not account for the time it takes to render and display a frame on screen. This causes audio\nto be slightly desynced.</li>\n<li>Undo/Redo are only available on touch devices (two/three finger tap)</li>\n<li>The frame selector can only be zoomed on mobile</li>\n<li>Large projects take a long time to load</li>\n<li>Frames with many actions take a long time to undo</li>\n<li>The final animation cannot be exported. For my project, I used a screen recorder to capture the result and\nthen made some small edits in a video editor.</li>\n<li>In order for multiple people to collaborate on an animation, they must share an account</li>\n</ul>\n<p>All of these issues have straightforward solutions if I ever continue developing Animator in the future.</p>\n</body></html>"}},"__N_SSG":true}